In [1]:
import pandas as pd

friends = [
    {'age': 15, 'job': 'student'},
    {'age': 25, 'job': 'developer'},
    {'age': 30, 'job': 'teacher'}
]

df = pd.DataFrame(friends,
                 index=['John', 'Jenny', 'Nate'],
                 columns=['age', 'job'])

In [2]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [3]:
df.drop(['John', 'Nate'])

       age        job
Jenny   25  developer

In [4]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [5]:
df = df.drop(['John', 'Nate'])

In [6]:
df = pd.DataFrame(friends,
                 index=['John', 'Jenny', 'Nate'],
                 columns=['age', 'job'])

In [7]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [8]:
df.drop(['John', 'Nate'], inplace=True)

In [9]:
df

       age        job
Jenny   25  developer

In [12]:
friends = [
    {'name': 'John', 'age': 15, 'job': 'student'},
    {'name': 'Ben', 'age': 25, 'job': 'developer'},
    {'name': 'Jenny', 'age': 30, 'job': 'teacher'}
]

df = pd.DataFrame(friends,
                 columns=['name', 'age', 'job'])

In [13]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [14]:
df = df.drop(df.index[[0,2]])

In [15]:
df

  name  age        job
1  Ben   25  developer

In [16]:
df = pd.DataFrame(friends,
                 columns=['name', 'age', 'job'])

In [17]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [18]:
df = df[df.age > 20]

In [19]:
df

    name  age        job
1    Ben   25  developer
2  Jenny   30    teacher

In [20]:
df = pd.DataFrame(friends,
                 columns=['name', 'age', 'job'])

In [21]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [22]:
df = df.drop('age', axis=1)

In [23]:
df

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher

In [24]:
df = pd.DataFrame(friends,
                 columns=['name', 'age', 'job'])

In [25]:
df.drop('age', axis=1, inplace=True)

In [26]:
df

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher